#!/bin/bash


: '
Successfull example: Hilink version

$ ./balong_flash -p /dev/ttyUSB2 E3372h-607_UPDATE_22.200.05.00.00.BIN 

 Программа для прошивки устройств на Balong-чипсете, V3.0.280, (c) forth32, 2015, GNU GPLv3
--------------------------------------------------------------------------------------------------

 Код файла прошивки: 9 (ONLY_FW)
                                 
 Цифровая подпись: 2958 байт
 Хеш открытого ключа: 778A8D175E602B7B779D9E05C330B5279B0661BF2EED99A20445B366D63DD697
 Версия прошивки: 22.200.05.00.00
 Платформа:       BV7R11HS
 Дата сборки:     2015.01.22 00:55:06
 Заголовок: версия 1, код соответствия: HWEW11.1
 Режим цифровой подписи: ONLY_FW (2958 байт)
 Версия протокола: 7200B--SKCBADZM
 Идентификатор устройства: HUAWEI BV7R11HS
----------------------------------------------------

##  ---- Имя раздела ---- записано
00  Fastboot              100%
01  M3Boot_R11            100%
02  M3Boot-ptable         100%
03  Kernel_R11            100%
04  VxWorks_R11           100%
05  M3Image_R11           100%
06  DSP_R11               100%
07  Nvdload_R11           100%
08  System                100%
09  APP                   100%

 Перезагрузка модема...

$ ./balong_flash -p /dev/ttyUSB0 WEBUI_17.100.06.00.03_Hilink_V7R2_9x25_CPIO.bin 

 Программа для прошивки устройств на Balong-чипсете, V3.0.280, (c) forth32, 2015, GNU GPLv3
--------------------------------------------------------------------------------------------------

 Код файла прошивки: e (ISO_WEBUI)
                                 
 Цифровая подпись: 1110 байт
 Хеш открытого ключа: 778A8D175E602B7B779D9E05C330B5279B0661BF2EED99A20445B366D63DD697
 Версия прошивки: INPUT
 Дата сборки:     2014.09.03 10:34:49
 Заголовок: версия 1, код соответствия: HWEW11.1
 Режим цифровой подписи: ISO_WEBUI (1110 байт)
 Версия протокола: 7200B--SKCBADZM
 Идентификатор устройства: HUAWEI BV7R11HS
----------------------------------------------------

##  ---- Имя раздела ---- записано
00  Oeminfo               100%
01  CDROMISO              100%
02  WEBUI                 100%

 Перезагрузка модема...
'

: '
Successfull example: non-Hilink version

$ ./balong_flash -p /dev/ttyUSB2 E3372h-153_UPDATE_21.180.01.00.00.BIN

 Программа для прошивки устройств на Balong-чипсете, V3.0.280, (c) forth32, 2015, GNU GPLv3
--------------------------------------------------------------------------------------------------

 Код файла прошивки: 9 (ONLY_FW)
                                 
 Цифровая подпись: 2958 байт
 Хеш открытого ключа: 778A8D175E602B7B779D9E05C330B5279B0661BF2EED99A20445B366D63DD697
 Версия прошивки: 21.180.01.00.00
 Платформа:       BV7R11HS
 Дата сборки:     2014.09.30 07:17:54
 Заголовок: версия 1, код соответствия: HWEW11.1
 Режим цифровой подписи: ONLY_FW (2958 байт)
 Версия протокола: 7200B--SKCBADZM
 Идентификатор устройства: HUAWEI BV7R11HS
----------------------------------------------------

##  ---- Имя раздела ---- записано
00  Fastboot              100%
01  M3Boot_R11            100%
02  M3Boot-ptable         100%
03  Kernel_R11            100%
04  VxWorks_R11           100%
05  M3Image_R11           100%
06  DSP_R11               100%
07  Nvdload_R11           100%
08  System                100%
09  APP                   100%

 Перезагрузка модема...
'

make -s && ./balong_flash -p /dev/ttyUSB2 E3372h-153_UPDATE_21.180.01.00.00.BIN
